Repository: eddyem/ch55x
Catalog: CH55xtool/locale/*/*.po
Languages: ru

source: %d extra options:
ru: %d лишних опций:

source: Another copy of this process found, pid=%d. Exit.
ru: Найдена другая копия этого процесса, pid=%d. Выход.

source: Bad chip version
ru: Неправильная версия чипа

source: Can't erase chip
ru: Не могу очистить чип

source: Can't fix writing
ru: Не могу завершить запись

source: Can't open %s
ru: Не могу открыть %s

source: Can't write flash
ru: Не могу записать флеш

source: Chip not found
ru: Чип не найден

source: Found %s, version %s; flash size %d
ru: Найден %s, версия %s; размер флеша %d

source: No devices found
ru: Устройства не обнаружены

source: Reset MCU
ru: Перезапуск МК

source: Try to write %s
ru: Пытаюсь записать %s

source: Verification of flash failed
ru: Проверка провалилась

source: Verify data
ru: Проверка даных

source: Version %s not supported
ru: Версия %s не поддерживается

source: Wrong detect_chip()?
ru: Неправильный detect_chip()?

source: Wrong getver()?
ru: Неправильный getver()?

source: don't reset MCU after writing
ru: не перезапускать МК после прошивки

source: name of binary file to flash
ru: название бинарника для прошивки

source: pidfile (default:
ru: pid-файл (по умолчанию:

source: show this help
ru: отобразить эту справку
